# 1.算数运算符
# 1.1 +-*/
# print(1/0)
# 使用算数运算符/，除的商一定是浮点数,且除数不能为零。
# a = 1/1
# print(type(a))
# 1.2  取整除，就是//，就是取商的整数部分，不管四舍五入，小数部分就忽略小数
# a = 5
# b = 2
# print(a // b)
# 结果为2
# print(3.0//3)
# 取余数,%,只要余数部分
# print(a % b)
# 结果是1
# 1 .4，取幂，**，m**n是m的n次方
# print(a ** b)
# 结果是25
# 使用算数运算符，其中若有浮点数，结果也会用浮点数表示
# 优先级排序:幂(最高级)>乘除,取余,取整除>加减
# print(3**2+2/2)


# 2.赋值运算符
# 2.1: 给变量赋值
# num1 = 5
# num2 = 8
# # 将一个变量的值赋给另一个变量
# num3 = num1
# print(num3)
# num4 = num2
# print(num4)
# # 加一起,将运算的值加给变量
# total = num3 + num4
# print(total)
# 2.2+=
# a = 1
# print(a)
# a += 1
# # 等效于a = a + 1
# print(a)
#
#
# n1 = 99  # 成本价
# n2 = 66  # 利润
# # n1 = n1 + n2  # 售价
# n1 += n2      # 和上边等效,等于 n1 +n2 = n1
# print(n1)
# 2.3 -=
# a = 1
# b = 2
# # a = a -b
# a -= b
# print(a)
# 赋值运算符要连着写,不然会报错
# 用它时变量要先被提前定义,不然会报错
# print(10+=3)  纯数字也不能使用,不然会语法报错,因为赋值运算符是针对变量存在的


# 3.input() 输入函数
# print()
# input(prompt) prompt是提示,会在控制台中显示
# name = input("请输入姓名")
# print(name)
# pwd = input("请输入你的密码")
# print(pwd)


# 4.转义字符
# 4.1 \t 制表符 通常表示空4个字符,也称缩进
# print("姓名\t年龄\t电话")
# 像表格
# 4,2 换行符 \n ,默认就是
# print(1111,end="2")
# print(222)
# print("哈哈\n嘻嘻")
# 4.3 \r 回车   表示将当前位置移到本行开头
# print("wwjwwjjwj\r1111111111111")
# 就相当于前面的不要了,输出后面的
# 4.4   //  反斜杠符号
# print("Hello\\t World")
# 就是至少写两个就能输出,要不然打不出来, \\是1个.\\\是两个.\\\\还是两个正常情况
# 如果太多了麻烦.就是取消转义
# r原生字符串,默认取消转义
# print(r"Hello\\t World")
# print(1)
